ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/DEBUGSS_1.0.xml
        <register id="DEBUGSS_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TXIFG" description="Raw interrupt status for TXIFG" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="TXIFG did not occur"/>
                <bitenum id="SET" value="0x1" description="TXIFG occurred"/>
            </bitfield>
            <bitfield id="RXIFG" description="Raw interrupt status for RXIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="RXIFG did not occur"/>
                <bitenum id="SET" value="0x1" description="RXIFG occurred"/>
            </bitfield>
            <bitfield id="PWRUPIFG" description="Raw interrupt status for PWRUPIFG" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="PWRUPIFG did not occur"/>
                <bitenum id="SET" value="0x1" description="PWRUPIFG occurred"/>
            </bitfield>
            <bitfield id="PWRDWNIFG" description="Raw interrupt status for PWRDWNIFG" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="PWRUPIFG did not occur"/>
                <bitenum id="SET" value="0x1" description="PWRUPIFG occurred"/>
            </bitfield>
        </register>
        <register id="DEBUGSS_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TXIFG" description="Masked interrupt status for TXIFG" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="TXIFG did not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="TXIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="RXIFG" description="Masked interrupt status for RXIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="RXIFG did not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="RXIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="PWRUPIFG" description="Masked interrupt status for PWRUPIFG" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="PWRUPIFG did not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="PWRUPIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="PWRDWNIFG" description="Masked interrupt status for PWRDWNIFG" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="PWRUPIFG did not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="PWRUPIFG requests an interrupt service routine"/>
            </bitfield>
        </register>
        <register id="DEBUGSS_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TXIFG" description="Sets TXIFG in RIS register" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to TXIFG is set"/>
            </bitfield>
            <bitfield id="RXIFG" description="Sets RXIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to RXIFG is set"/>
            </bitfield>
            <bitfield id="PWRUPIFG" description="Sets PWRUPIFG in RIS register" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to PWRUPIFG is set"/>
            </bitfield>
            <bitfield id="PWRDWNIFG" description="Sets PWRDWNIFG in RIS register" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to PWRUPIFG is set"/>
            </bitfield>
        </register>
        <register id="DEBUGSS_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="TXIFG" description="Clears TXIFG in RIS register" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to TXIFG is cleared"/>
            </bitfield>
            <bitfield id="RXIFG" description="Clears RXIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to RXIFG is cleared"/>
            </bitfield>
            <bitfield id="PWRUPIFG" description="Clears PWRUPIFG in RIS register" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to PWRUPIFG is cleared"/>
            </bitfield>
            <bitfield id="PWRDWNIFG" description="Clears PWRDWNIFG in RIS register" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to PWRUPIFG is cleared"/>
            </bitfield>
        </register>
        </group>
    <register id="DEBUGSS_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for peripheral events" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="DEBUGSS_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DEBUGSS_TXD" width="32" offset="0x1100" description="Transmit data register">
    </register>
    <register id="DEBUGSS_TXCTL" width="32" offset="0x1104" description="Transmit control register">
        <bitfield id="TRANSMIT" description="Indicates data request in DSSM.TXD, set on write via Debug AP to DSSM.TXD.

A read of the DSSM.TXD register by SW will clear the TX field. The tool can check that TXD is empty by reading this field." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="EMPTY" value="0x0" description="TXD is empty"/>
            <bitenum id="FULL" value="0x1" description="TXD is full"/>
        </bitfield>
        <bitfield id="TRANSMIT_FLAGS" description="Generic TX flags that can be set by external debug tool. Functionality is defined by SW." begin="31" end="1" width="31" rwaccess="R">
        </bitfield>
    </register>
    <register id="DEBUGSS_RXD" width="32" offset="0x1108" description="Receive data register">
    </register>
