ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/DEBUGSS_1.0.xml
    <register id="DEBUGSS_RXCTL" width="32" offset="0x110C" description="Receive control register">
        <bitfield id="RECEIVE" description="Indicates SW write to the DSSM.RXD register.
A read of the DSSM.RXD register by SWD Access Port will clear the RX field." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="EMPTY" value="0x0" description="RXD empty"/>
            <bitenum id="FULL" value="0x1" description="RXD full"/>
        </bitfield>
        <bitfield id="RECEIVE_FLAGS" description="Generic RX flags that can be set by SW and read by external debug tool. Functionality is defined by SW." begin="7" end="1" width="7" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DEBUGSS_SPECIAL_AUTH" width="32" offset="0x1200" description="Special enable authorization register">
        <bitfield id="SECAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can use the Security-AP to communicate with security control logic. When deasserted, a DAPBUS firewall will isolate the AP and prevent access to the Security-AP." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable SEC-AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable SEC-AP"/>
        </bitfield>
        <bitfield id="SWDPORTEN" description="When asserted, the SW-DP functions normally. 
When deasserted, the SW-DP effectively disables all external debug access." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable SWD port"/>
            <bitenum id="ENABLE" value="0x1" description="Enable SWD port"/>
        </bitfield>
        <bitfield id="DFTAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can then access the DFT-AP external to the DebugSS lite. When deasserted, a DAPBUS firewall will isolate the AP and prevent access." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable DFT-TAP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable DFT-TAP"/>
        </bitfield>
        <bitfield id="ETAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can then access an ET-AP external to the DebugSS lite. When deasserted, a DAPBUS firewall will isolate the AP and prevent access." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable ET+ -AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable ET+ -AP"/>
        </bitfield>
        <bitfield id="CFGAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can use the Config-AP to read device configuration information. When deasserted, a DAPBUS firewall will isolate the AP and prevent access to the Config-AP." begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable CFG-AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable CFG-AP"/>
        </bitfield>
        <bitfield id="AHBAPEN" description="Disabling / enabling debug access to the M0+ Core via the AHB-AP DAP bus isolation." begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable AHB-AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable AHB-AP"/>
        </bitfield>
        <bitfield id="PWRAPEN" description="An active high input. When asserted (and SWD access is also permitted), the debug tools can then access the PWR-AP to power and reset state of the CPU. When deasserted, a DAPBUS firewall will isolate the AP and prevent access." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Disable PWR-AP"/>
            <bitenum id="ENABLE" value="0x1" description="Enable PWR-AP"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_SPECIAL_AUTH_SET" width="32" offset="0x1204" description="Special enable authorization set register">
        <bitfield id="SET_SECAPEN" description="This bit sets SECAPEN bit in SPECIAL_AUTH register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Set SECAPEN"/>
        </bitfield>
        <bitfield id="SET_SWDPORTEN" description="This bit sets SWDPORTEN in SPECIAL_AUTH register." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Set SWDPORTEN"/>
        </bitfield>
        <bitfield id="SET_DFTAPEN" description="This bit sets DFTAPEN in SPECIAL_AUTH register." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Set DFTTAPEN"/>
        </bitfield>
        <bitfield id="SET_ETAPEN" description="This bit sets ETAPEN in SPECIAL_AUTH register." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Set ETAPEN"/>
        </bitfield>
        <bitfield id="SET_AHBAPEN" description="This bit sets AHBAPEN in SPECIAL_AUTH register." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Set AHBAPEN"/>
        </bitfield>
        <bitfield id="SET_CFGAPEN" description="This bit sets CFGAPEN in SPECIAL_AUTH register." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Set CFGAPEN"/>
        </bitfield>
        <bitfield id="SET_PWRAPEN" description="This bit sets PWRAPEN in SPECIAL_AUTH register." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Set PWRAPEN"/>
        </bitfield>
    </register>
