ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/DEBUGSS_1.0.xml
    <register id="DEBUGSS_SPECIAL_AUTH_CLR" width="32" offset="0x1208" description="Special enable authorization clear register">
        <bitfield id="CLR_SECAPEN" description="This bit clears SECAPEN bit in SPECIAL_AUTH register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear SECAPEN"/>
        </bitfield>
        <bitfield id="CLR_SWDPORTEN" description="This bit clears SWDPORTEN in SPECIAL_AUTH register." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clears SWDPORTEN"/>
        </bitfield>
        <bitfield id="CLR_DFTAPEN" description="This bit clears DFTTAPEN in SPECIAL_AUTH register." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear DFTTAPEN"/>
        </bitfield>
        <bitfield id="CLR_ETAPEN" description="This bit clears ETAPEN in SPECIAL_AUTH register." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear ETAPEN"/>
        </bitfield>
        <bitfield id="CLR_AHBAPEN" description="This bit clears AHBAPEN in SPECIAL_AUTH register." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear AHBAPEN"/>
        </bitfield>
        <bitfield id="CLR_CFGAPEN" description="This bit clears CFGAPEN in SPECIAL_AUTH register." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear CFGAPEN"/>
        </bitfield>
        <bitfield id="CLR_PWRAPEN" description="This bit clears PWRAPEN in SPECIAL_AUTH register." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear PWRAPEN"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_APP_AUTH" width="32" offset="0x1210" description="Application CPU0 authorization register">
        <bitfield id="DBGEN" description="Controls invasive debug enable." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Invasive debug disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Invasive debug enabled"/>
        </bitfield>
        <bitfield id="NIDEN" description="Controls non-invasive debug enable." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Non-invasive debug disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Non-invasive debug enabled"/>
        </bitfield>
        <bitfield id="SPIDEN" description="Secure invasive debug enable." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Invasive debug disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Invasive debug enabled"/>
        </bitfield>
        <bitfield id="SPNIDEN" description="Secure non-invasive debug enable." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="Invasive debug disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Invasive debug enabled"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_APP_AUTH_SET" width="32" offset="0x1214" description="Application CPU0 authorization set register">
        <bitfield id="SET_DBGEN" description="Sets DBGEN bit in APPCPU0_AUTH register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Sets DBGEN"/>
        </bitfield>
        <bitfield id="SET_NIDEN" description="Sets NIDEN bit in APPCPU0_AUTH register." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Sets NIDEN"/>
        </bitfield>
        <bitfield id="SET_SPIDEN" description="Sets SPIDEN bit in APPCPU0_AUTH register." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Sets NIDEN"/>
        </bitfield>
        <bitfield id="SET_SPNIDEN" description="Sets SPNIDEN bit in APPCPU0_AUTH register." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Sets NIDEN"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_APP_AUTH_CLR" width="32" offset="0x1218" description="Application CPU0 authorization clear register">
        <bitfield id="CLR_DBGEN" description="Clears DBGEN bit in APPCPU0_AUTH register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clears DBGEN"/>
        </bitfield>
        <bitfield id="CLR_NIDEN" description="Clears NIDEN bit in APPCPU0_AUTH register." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clears NIDEN"/>
        </bitfield>
        <bitfield id="CLR_SPIDEN" description="Clears SPIDEN bit in APPCPU0_AUTH register." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Sets NIDEN"/>
        </bitfield>
        <bitfield id="CLR_SPNIDEN" description="Clears SPNIDEN bit in APPCPU0_AUTH register." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="SET" value="0x1" description="Sets NIDEN"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_DEVICEID" width="32" offset="0x1300" description="Device identification register">
        <bitfield id="PRESENT" description="The value of 1 in bit 0 of the device identification register means the device idetifiaction is present." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NOK" value="0x0" description="Not-Okay. The Device-ID is not present."/>
            <bitenum id="OK" value="0x1" description="Okay. The Device-ID is present."/>
        </bitfield>
        <bitfield id="MANUFACTURER" description="TI's JEDEC bank and company code, which is 00000010111b." begin="11" end="1" width="11" rwaccess="R">
            <bitenum id="TIJEDEC" value="0x17" description="TI's JDEC ID"/>
        </bitfield>
        <bitfield id="PARTNUM" description="Part number of the device." begin="27" end="12" width="16" rwaccess="R">
            <bitenum id="MIN" value="0x0" description="Minimum part number"/>
            <bitenum id="MAX" value="0xFFFF" description="Maximum part number"/>
        </bitfield>
        <bitfield id="VERSION" description="Revision of the device." begin="31" end="28" width="4" rwaccess="R">
            <bitenum id="MIN" value="0x0" description="Minimum revision"/>
            <bitenum id="MAX" value="0xF" description="Maximium revision"/>
        </bitfield>
    </register>
    <register id="DEBUGSS_USERID" width="32" offset="0x1304" description="User code identification regsiter">
        <bitfield id="PART" description="Bit pattern that uniquely identifies the part." begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="MIN" value="0x0" description="Minimum part number"/>
            <bitenum id="MAX" value="0xFFFF" description="Maximum part number"/>
        </bitfield>
        <bitfield id="VARIANT" description="Bit pattern uniqueley identifies the variant of the part." begin="23" end="16" width="8" rwaccess="R">
            <bitenum id="MIN" value="0x0" description="Minimum variant"/>
            <bitenum id="MAX" value="0xFF" description="Maximum variant"/>
        </bitfield>
        <bitfield id="MINORREV" description="Monotonic increasing value indicating a new revision of the device that preservs compatibility with lesser minorrev values." begin="27" end="24" width="4" rwaccess="R">
            <bitenum id="MIN" value="0x0" description="Minimum minor revision"/>
            <bitenum id="MAX" value="0xF" description="Maximum minor revision"/>
        </bitfield>
        <bitfield id="MAJORREV" description="Monotonic increasing value indicating a new revision of the device significant enough that users of the device may have to revise PCB or software design." begin="30" end="28" width="3" rwaccess="R">
            <bitenum id="MIN" value="0x0" description="Minimum major revision"/>
            <bitenum id="MAX" value="0x7" description="Maximum major revision"/>
        </bitfield>
        <bitfield id="START" description="Start bit. A value of 1 indicates the USERID is present." begin="31" end="31" width="1" rwaccess="R">
            <bitenum id="NOK" value="0x0" description="Not-Okay. The User-ID is not defined."/>
            <bitenum id="OK" value="0x1" description="Okay. Start of the User-ID"/>
        </bitfield>
    </register>

</module>